Documents/АктСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>АктСверки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовЗаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потребитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льготчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктСверки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	ОтветственныйВладелецИКвоПрописанных    = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                      = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.Здание                           = Объект.ЛицевойСчет.Владелец;
    Объект.ОбъектЛицевогоСчета              = Объект.ЛицевойСчет.ОбъектЛицевогоСчета;
	ПриборыУчета                            = ПолучитьСписокПриборов(Объект.ЛицевойСчет);
	УслугиПоЛС = ВыбратьУслугиЛС(Справочники.Услуги.НайтиПоКоду("000000019"), Объект.ЛицевойСчет);
	Объект.Корректировки.Очистить();
	Для Каждого стрПриборы Из ПриборыУчета Цикл
		НовСтрока = Объект.Корректировки.Добавить();
		НовСтрока.Услуга = стрПриборы.Услуга;
		НовСтрока.ПриборУчета = стрПриборы.ПриборУчета;
		НовСтрока.Показание = стрПриборы.Значение;
		НовСтрока.ВидТарифа = стрПриборы.ВидТарифа;
		НовСтрока.Коэффициент = стрПриборы.Коэффициент;
		НовСтрока.ВидНачисления = Перечисления.ВидыНачислений.Начисление;
	КонецЦикла;
	//Если УслугиПоЛС.Количество() <> 0 Тогда
	//	НовСтрока1 = Объект.Корректировки.Добавить();
	//	НовСтрока1.Услуга = Справочники.Услуги.НайтиПоКоду("000000019");
	//	НовСтрока1.ВидТарифа = Перечисления.ВидыТарифов.Общий;
	//	НовСтрока1.ВидНачисления = Перечисления.ВидыНачислений.Корректировка;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция КорректировкиПоказаний(ТабЧасть, Тариф)
	ТарифВодоотвод = 20.772;//ОбщийМодульМВК.ПолучитьТарифПоУслуге(Справочники.Услуги.НайтиПоКоду("000000019"));
	УслугиПоЛС = ВыбратьУслугиЛС(Справочники.Услуги.НайтиПоКоду("000000019"), Объект.ЛицевойСчет);
	Если УслугиПоЛС.Количество() <> 0 Тогда
		КвоКубовОбщее = (ТабЧасть.ПоказаниеНовое - ТабЧасть.Показание) * ТабЧасть.Коэффициент;
		ОбщаяСумма = КвоКубовОбщее * (Тариф + ТарифВодоотвод);
		СуммаХВ = КвоКубовОбщее * Тариф;
		СуммаКН = ОбщаяСумма - (КвоКубовОбщее * Тариф);
		ТабЧасть.СуммаКорректировки = СуммаХВ;
		
		НовСтрока = Объект.Корректировки.Добавить();
		НовСтрока.Услуга = Справочники.Услуги.НайтиПоКоду("000000019");
		ТекТарифК = ТарифВодоотвод;    //ОбщийМодульМВК.ПолучитьТарифПоУслуге(НовСтрока.Услуга);
		НовСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		НовСтрока.ВидНачисления = Перечисления.ВидыНачислений.Корректировка;
		НовСтрока.СуммаКорректировки = СуммаКН;
		НовТабЧасть = Новый Структура;
		НовТабЧасть.Вставить("СуммаКорректировки",СуммаХВ); 
		Возврат НовТабЧасть;
	Иначе
		НовТабЧасть = Новый Структура;
		НовТабЧасть.Вставить("СуммаКорректировки",(ТабЧасть.ПоказаниеНовое - ТабЧасть.Показание) * ТабЧасть.Коэффициент * Тариф);
        Возврат НовТабЧасть;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПроверитьУслугу(Услуга)
	ВидУслугиХВ = Справочники.Услуги.НайтиПоКоду("Р00000192");
	Возврат ВидУслугиХВ;
КонецФункции

&НаСервере
Функция УслугаКН()
	ВидУслугиКН = Справочники.Услуги.НайтиПоКоду("000000019");
	Возврат ВидУслугиКН;
КонецФункции

&НаКлиенте
Процедура КорректировкиПоказаниеНовоеПриИзменении(Элемент)
	ТекСтрока = Элементы.Корректировки.ТекущиеДанные;
	ВидУслугиХВ = ПроверитьУслугу(ТекСтрока.Услуга);
	Если ТекСтрока.Услуга = ВидУслугиХВ Тогда
		
			тчКоррекция = Новый Структура;
			тчКоррекция.Вставить("Услуга", ВидУслугиХВ);
			тчКоррекция.Вставить("Показание", ТекСтрока.Показание);
			тчКоррекция.Вставить("ПоказаниеНовое", ТекСтрока.ПоказаниеНовое);
			тчКоррекция.Вставить("Коэффициент", ТекСтрока.Коэффициент);
			тчКоррекция.Вставить("СуммаКорректировки", ТекСтрока.СуммаКорректировки);
			ТекТариф = 22.92;   //ОбщийМодульМВК.ПолучитьТарифПоУслуге(ВидУслугиХВ);
			тчВозврат = КорректировкиПоказаний(тчКоррекция, ТекТариф);
			ТекСтрока.СуммаКорректировки = тчВозврат.СуммаКорректировки;
		Иначе
		ВидУслугиКН = УслугаКН();
		ТекТариф = 20.772;   //ОбщийМодульМВК.ПолучитьТарифПоУслуге(ВидУслугиКН);
		ТекСтрока.СуммаКорректировки = (ТекСтрока.ПоказаниеНовое - ТекСтрока.Показание) * ТекТариф * ТекСтрока.Коэффициент;
		
	КонецЕсли;
	ТекСтрока.Разница = ТекСтрока.ПоказаниеНовое - ТекСтрока.Показание;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьСписокПриборов(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.Значение,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга,
		|	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифа,
		|	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ОбъектУстановки = &ОбъектУстановки) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ПО (УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета)";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Список = Запрос.Выполнить().Выгрузить();

	Возврат Список;
КонецФункции

&НаКлиенте
Процедура ПечатьАктСверки(Команда)
	ОткрытьФорму("Отчет.АктСверки.Форма.ФормаОтчета");
КонецПроцедуры

&НаСервере
Процедура КорректировкиСуммаКорректировкиПриИзмененииНаСервере()
	//УслугиПоЛС = ВыбратьУслугиЛС(Справочники.Услуги.НайтиПоКоду("000000048"), Справочники.Услуги.НайтиПоКоду("000000019"), Объект.ЛицевойСчет);
	//Если УслугиПоЛС.Количество() = 2 Тогда
	//	Для Каждого стр Из Объект.Корректировки Цикл
	//		
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КорректировкиСуммаКорректировкиПриИзменении(Элемент)
	КорректировкиСуммаКорректировкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ВыбратьУслугиЛС(УслугаКН, ЛС)
	сзУслуги = Новый СписокЗначений;
	//сзУслуги.Добавить(УслугаХВ);
	сзУслуги.Добавить(УслугаКН);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.Услуга
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет = &ЛицевойСчет
	    |				И Услуга В (&Услуга)
	    |				И Действует = ИСТИНА) КАК НазначенныеУслугиСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Услуга", сзУслуги);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Услуги = Запрос.Выполнить().Выгрузить();
	Возврат Услуги;
КонецФункции
